# Pandas Tutorial

In [2]:
# Importing pandas using conventional method
import pandas as pd

### 1. How to read a table using Pandas

In [3]:
orders = pd.read_table('http://bit.ly/chiporders')

#### Difference between read_table and read_csv methods of pandas is in the default params. The seperator is '\t' (tab) for read_table but ',' for read_csv.

In [4]:
# To get the first 5 rows of the dataset
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
# You can specify the number of rows that you want to see by specifying like this
orders.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [6]:
# To get the last rows of the dataset
orders.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

### 2. How to specify separator in Pandas read_table() method

In [8]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)

In [9]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
# Selecting a particular column or a series from a dataframe
# There are two ways - 
# 1. Dot operator - eg. users.occupation 
# 2. Using Bracket Notation - eg. users['occupation']
users.occupation.head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [12]:
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

Bracket notation will always work, whereas dot notation has limitations:
- Dot notation doesn't work if there are spaces in the Series name
- Dot notation doesn't work if the Series has the same name as a DataFrame method or attribute (like 'head' or 'shape')
- Dot notation can't be used to define the name of a new Series

##### In Pandas, Methods like read_table(), read_csv() end with parantheses whereas attributes do not for eg. .shape, .dtypes

### 3. How to check the datatypes of the columns in the Dataframe

In [15]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 4. How to check for the size of the Dataframe

In [16]:
users.shape

(943, 5)

### 5. How to know the details of the Dataframe

In [17]:
# It provides the statistics summary
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [18]:
# To check for only object type colums 
users.describe(include=['object'])

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

### 6. How to rename the column names in the Dataframe

In [20]:
# Firstly how to see all the column names in the dataframe
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [26]:
# Columns of a Dataframe can be renamed using the following methods:
# 1. Dataframe.rename(columns= {'X': 'x', 'Y':'y'}, inplace=True)
users.rename(columns={'user_id': 'ID', 'age': 'Age'}, inplace=True)
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code'], dtype='object')

#### inplace=True - helps to perform the operation on the same object whereas inplace=False returns the copy of the object after applying the operation to it.

In [25]:
# 2. Specify a list of names of the columns and then set the Dataframe.columns = column_name_list 
users_cols = ['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code']
users.columns = users_cols
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code'], dtype='object')

In [29]:
# 3. Replace the columns right when you are reading the data
users_cols = ['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code']
users = pd.read_table('http://bit.ly/movieusers', header=None, names=users_cols)
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip_Code'], dtype='object')

In [31]:
# Column names can be read as string and all string operations can then be applied easily
users.columns = users.columns.str.replace('_', ' ')
users.columns

Index(['ID', 'Age', 'Gender', 'Occupation', 'Zip Code'], dtype='object')

### 7. How to delete/drop a column from a Dataframe

In [45]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [38]:
users.drop('zip_code', axis=1, inplace=True)
users.head()

   user_id  age gender  occupation
0        1   24      M  technician
1        2   53      F       other
2        3   23      M      writer
3        4   24      M  technician
4        5   33      F       other

axis = 0 
- used for performing opertaions on the rows
- operation should move down - row axis
- 'index' -> alias for axis = 0

axis = 1
- used for perfoming operations on the columns
- operation should move across - column axis
- 'columns' -> alias for axis = 1

In [44]:
# We can drop multiple columns altogether
users.drop(['zip_code', 'user_id'], axis=1, inplace=True)
users.head()

   age gender  occupation
0   24      M  technician
1   53      F       other
2   23      M      writer
3   24      M  technician
4   33      F       other

In [46]:
# To remove rows 
users.drop([0, 1], axis=0, inplace=True)
users.head()

   user_id  age gender     occupation zip_code
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344

### 8. Sorting Pandas Dataframe or Series

In [47]:
# Read a dataset of top-rated IMDb movies into a DataFrame
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [48]:
# Sort the 'title' Series in ascending order (returns a Series)
# Note: this is temporary sorting
movies.title.sort_values().head()

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
Name: title, dtype: object

In [49]:
# Sort in descending order instead
movies.title.sort_values(ascending=False).head()

864               [Rec]
526                Zulu
615          Zombieland
677              Zodiac
955    Zero Dark Thirty
Name: title, dtype: object

In [50]:
# Sort the entire DataFrame by the 'title' Series (returns a DataFrame)
movies.sort_values('title').head()

,star_rating,title,content_rating,genre,duration,actors_list
542,7.8,(500) Days of Summer,PG-13,Comedy,95,"[u'Zooey Deschanel', u'Joseph Gordon-Levitt', ..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
201,8.1,12 Years a Slave,R,Biography,134,"[u'Chiwetel Ejiofor', u'Michael Kenneth Willia..."
698,7.6,127 Hours,R,Adventure,94,"[u'James Franco', u'Amber Tamblyn', u'Kate Mara']"
110,8.3,2001: A Space Odyssey,G,Mystery,160,"[u'Keir Dullea', u'Gary Lockwood', u'William S..."